
#if defined(_WIN32) || defined(_WIN64)
	#ifndef WINAPI
		#define WINAPI __stdcall
	#endif
#else
	#define WINAPI 
#endif

#ifdef __cplusplus
extern "C" {
#endif

/****************************************************************************
	功  能：获取算法版本号
	参  数：version  - 长度为100字节的字符串指针
	返  回：   0     - 成功
              其他   - 失败
*****************************************************************************/
int WINAPI mxGetVersion_id(char* version);

/************************************************************************
	功	能：从指纹图象中抽取特征
	参	数：input - 指向指纹图象缓冲的指针，图象缓冲为256X360字节
            bzBuf - 指针指向现场录入的指纹特征，长度=512字节
	返	回：  1-成功，其他-失败
************************************************************************/
int WINAPI mxGetTz512From256X360_id(unsigned char *input,unsigned char *tzBuf);

/************************************************************************
	功	能：从指纹图象中抽取特征
	参	数：input - 指向指纹图象缓冲的指针，图象缓冲为152X200字节
            bzBuf - 指针指向现场录入的指纹特征，长度=512字节
	返	回：  1-成功，其他-失败
************************************************************************/
int WINAPI mxGetTz512From152X200_id(unsigned char *input,unsigned char *tzBuf);

/***************************************************************************
	功	能:	对输入的两个指纹特征值进行比对
	参	数:	fingerdata1 -  输入，指纹特征值1,512字节
			fingerdata2 -  输入，指纹特征值2,512字节
			 level      -  输入,匹配等级1~5
	返回值:	   0        -  匹配成功
			  -1        -  匹配失败
		      -2        -  数据非法
****************************************************************************/
int WINAPI mxFingerMatch512_id(unsigned char *fingerdata1, 
							unsigned char *fingerdata2,
					        int level);

/*************************************************************************
	功  能: 根据输入指纹特征与指纹模板集合，查找匹配指纹特征的指纹模板序号
	参  数: usersfingerdata - 输入，指纹模板集合
				(模板1+模板2+...+模板N),每个模板大小512字节
			usersNum        - 输入，指纹模板个数（建议500以内）      
			fingerdata      - 输入，指纹特征，512字节字符串
			level           - 输入，匹配安全等级1～5(通常设为3) 
	返  回:  >=0            - 模板序号（0 ~ usersNum-1）
		     <0             - 失败（其中：-1 - 匹配失败，其他 - 数据非法）
*************************************************************************/
int WINAPI mxFingerUsersMatch512_id(unsigned char *usersfingerdata,
							 int usersNum,
							 unsigned char* fingerdata,
							 int level);

#ifdef __cplusplus
}
#endif
